In [63]:
from pandas import Series

In [64]:
fruit = Series([2500,3800,1200,600], index=['apple','banana','peer','cherry'])

In [65]:
print(fruit)

apple     2500
banana    3800
peer      1200
cherry     600
dtype: int64

In [66]:
#값과 인덱스를 추출
print(fruit.values)
print(fruit.index)

[2500 3800 1200  600]
Index(['apple', 'banana', 'peer', 'cherry'], dtype='object')

In [67]:
#Dict 표현
fruitdata = {'apple':2500,'banana':3800,"peer":1200,'cherry':600}
fruit = Series(fruitdata)

In [68]:
print(type(fruitdata))
print(type(fruit))

<class 'dict'>
<class 'pandas.core.series.Series'>

In [69]:
fruit

apple     2500
banana    3800
peer      1200
cherry     600
dtype: int64

In [70]:
# Series 객체의 이름과 컬럼명을 설정 해 봅니다.
fruit.name = 'fruitprice'
fruit.index.name = 'fruitname'

In [71]:
fruit

fruitname
apple     2500
banana    3800
peer      1200
cherry     600
Name: fruitprice, dtype: int64

In [72]:
#dataframe
fruitdata = {'fruitname':['apple','banana','peer','cherry'],'fruitprice':[2500,3800,1200,600],'num' : [10,5,3,8]}
#딕셔너리
from pandas import DataFrame

fruitFrame = DataFrame(fruitdata)
fruitFrame

  fruitname  fruitprice  num
0     apple        2500   10
1    banana        3800    5
2      peer        1200    3
3    cherry         600    8

In [73]:
#특정 항목 추출하기
fruitFrame['fruitname']

0     apple
1    banana
2      peer
3    cherry
Name: fruitname, dtype: object

In [74]:
fruitFrame.fruitname

# 객체.속성.동작()
# 말.나이=20    말.달린다()

0     apple
1    banana
2      peer
3    cherry
Name: fruitname, dtype: object

In [75]:
#컬럼 추가하기
fruitFrame['year'] = '2022'
fruitFrame

  fruitname  fruitprice  num  year
0     apple        2500   10  2022
1    banana        3800    5  2022
2      peer        1200    3  2022
3    cherry         600    8  2022

In [76]:
#Series 객체의 추가
variable = Series([4,2,1], index = [0,2,3])
fruitFrame['stock'] = variable
fruitFrame

  fruitname  fruitprice  num  year  stock
0     apple        2500   10  2022    4.0
1    banana        3800    5  2022    NaN
2      peer        1200    3  2022    2.0
3    cherry         600    8  2022    1.0

In [77]:
#자료구조를 다뤄보기
#데이터 구조의 항목을 삭제

fruit.drop('banana')

fruit

fruitname
apple     2500
banana    3800
peer      1200
cherry     600
Name: fruitprice, dtype: int64

In [78]:
newFruit = fruit.drop('banana')
newFruit

fruitname
apple     2500
peer      1200
cherry     600
Name: fruitprice, dtype: int64

In [79]:
fruitdata

{'fruitname': ['apple', 'banana', 'peer', 'cherry'],
 'fruitprice': [2500, 3800, 1200, 600],
 'num': [10, 5, 3, 8]}

In [80]:
fruitName = fruitdata['fruitname']
fruitName

['apple', 'banana', 'peer', 'cherry']

In [81]:
fruitname = DataFrame(fruitdata, index=fruitName, columns =['fruitPrice','num'])
fruitFrame

  fruitname  fruitprice  num  year  stock
0     apple        2500   10  2022    4.0
1    banana        3800    5  2022    NaN
2      peer        1200    3  2022    2.0
3    cherry         600    8  2022    1.0

In [82]:
fruitFrame.drop(['num'],axis=1)

  fruitname  fruitprice  year  stock
0     apple        2500  2022    4.0
1    banana        3800  2022    NaN
2      peer        1200  2022    2.0
3    cherry         600  2022    1.0

In [83]:
#pandas slice
fruit

fruitname
apple     2500
banana    3800
peer      1200
cherry     600
Name: fruitprice, dtype: int64

In [84]:
fruit[:'peer']

fruitname
apple     2500
banana    3800
peer      1200
Name: fruitprice, dtype: int64

In [85]:
fruit1 = Series([5,9,10,3],index=['apple','banana','peer','cherry'])
fruit2 = Series([3,2,9,5,10],index=['apple','orange','banana','cherry','mango'])

In [86]:
newFruit = fruit1 + fruit2
newFruit

apple      8.0
banana    18.0
cherry     8.0
mango      NaN
orange     NaN
peer       NaN
dtype: float64

In [87]:
# DataFrame 객체의 기본 연산
fruitData1 = {'Ohio':[4,8,3,5],'Texas':[0,1,2,3]}
fruitData2 = {'Ohio':[3,0,2,1,7],'Colorado':[5,4,3,6,0]}
fruitFrame1 = DataFrame(fruitData1, columns=['Ohio','Texas'], 
              index=['apple','banana','cherry','peer'])
fruitFrame2 = DataFrame(fruitData2, columns=['Ohio','Colorado'],
              index=['apple','orange','banana','cherry','mango'])

In [88]:
fruitFrame1

        Ohio  Texas
apple      4      0
banana     8      1
cherry     3      2
peer       5      3

In [89]:
fruitFrame2

        Ohio  Colorado
apple      3         5
orange     0         4
banana     2         3
cherry     1         6
mango      7         0

In [90]:
fruitFrame1+fruitFrame2

        Colorado  Ohio  Texas
apple        NaN   7.0    NaN
banana       NaN  10.0    NaN
cherry       NaN   4.0    NaN
mango        NaN   NaN    NaN
orange       NaN   NaN    NaN
peer         NaN   NaN    NaN

In [91]:
# 데이터의 정렬

# Series의 정렬
fruit

fruitname
apple     2500
banana    3800
peer      1200
cherry     600
Name: fruitprice, dtype: int64

In [92]:
fruit.sort_values() #fruit.sort_values(ascending=True)

fruitname
cherry     600
peer      1200
apple     2500
banana    3800
Name: fruitprice, dtype: int64

In [93]:
fruit.sort_values(ascending=False)

fruitname
banana    3800
apple     2500
peer      1200
cherry     600
Name: fruitprice, dtype: int64

In [94]:
fruitName = fruitData['fruitName']

NameError: name 'fruitData' is not defined

In [95]:
fruitFrame = DataFrame(fruitData, index=fruitName, columns=['num','fruitPrice'])

NameError: name 'fruitData' is not defined